{
    "Ashen Void": {
        "deployment": "https://ashen-void.herokuapp.com",
        "repository": "https://github.com/AlecWGreene/MSU-Project3-Four-Horsemen",
        "description": "  This was the third and final project for the Michigan State full stack web development bootcamp. I had talked to my instructor and TA about doing a game for project 3, and they discouraged anything outside of a text adventure or the likes since we were required to use React. However, I decided that I wanted to make a game. I recruited the project memebers I had for Project 2, as well as another student I had worked on with Project 1. As the only team member with any experience in game development, I was chosen as the project lead and set out to design the project. <br />  We faced many challenges during development. First, to keep the game engine from using up too much memory, I built the game engine from scratch using the Entity-Component-System architecture. Among other reasons, not using repeated class instantiation saves the memory that repeated function declarations would normally consume. Configuring the game manager to render was complicated as well, because the react elements animate by sliding a spritesheet through a smaller parent component which has the overflow hidden. However, when the animating component is rotating or moving, the nested nature of the component makes it hard to make the sprite rotate without moving the entire component.  <br />  Many people were skeptical of the attempt, saying we had to use libraries like p5.js or openGL as React is infamously hard to animate and typically uses a lot of memory. However, we only had about a week of experience in React as it was and using an outside library for rendering would mean that importing any assets we found would be very difficult. Not to mention, anyone who assists with the rendering would have to learn a new framework in the midst of learning how to use React. We decided as a group that it was best to move forward with the project in React. Looking back, the project was a great experience which let us explore the React framework in an intensely in-depth manner, and I am glad that we pursued the path we did. <br />  The final project was a big hit at the class presentation and the demonstration day. Many audience memebers of our presentations have mentioned they played it after the presentation was over, and some requested the link to forward to others."
    },
    "Avalon Web App": {
        "deployment": "https://avalon-web-app.herokuapp.com",
        "repository": "https://github.com/AlecWGreene/MSUProject2Team4",
        "description": "  This was the Second project for the Michigan State full stack web development bootcamp. After project one, and at the behest of our instructor, we decided as a team that we would do the project without a team lead. This would lead to some complications where our development was a little bit fractured and uncoordinated. However, it was a lesson thoroughly learned in the importance of not only planning a project but ensuring that the plan has follow through. <br />  The premise of the game was to be an online multiplayer web app for the card game Avalon. Avalon is played by a group of 5-10 players who are assorted into 'Good Guys' and 'Bad Guys'. The identities are kept secret except for the bad guys (who know who the other bad guys are), Merlin (a good guy who knows who the bad guys are), and Percival (a good guy who knows who Merlin is). The game proceeds by taking turns selecting a party of players to 'Go on a Quest' where they will choose to either pass or fail the quest. <br />  The strategy in the game comes from social manipulation and intuition, reading the behaviour of others as they form parties and react to the information or arguments put forth. Because of this, I opted to integrate a websocket, namely socket.io, to incorporate a game chat. Players can chat and all other players in the game session will see the message along with a username and timestamp. The site also comes with a fully funciton account creation system, and lobby management system where players can browse open lobbies or join a lobby through an invite code. <br /> The project was a bit ambitious for a 2 week timespan, and without centralized leadership the detailed plan that I had created for the site was hard to implement directly. However, my team and I pulled it together by the end and had every feature funcitonign as intended. I learned a lot about handling/syncing user inputs, running game logic serverside, and how to adapt a project to delays on the fly."
    },
    "GenerationDoc": {
        "repository": "https://github.com/AlecWGreene/GenerationDoc",
        "description": "  This was a personal project I embarked on to self-teach myself Regular Expressions and Typescript. The package will take in a language preference, compile a series of RegEexp patterns by parsing a custom markup syntax patterns. Then when fed a file, the scraper class will recurrsively search for the deepested nested scopes and parse them into an expression. As it collapses the scopes, it tracks the information in a tree which then allows the scraper to document which functions/variables/classes belong to which parent objects. WIP atm, requires some bugfixing before it will be deployed to npm."
    }
}